Repository: 8planes/mirosubs
Catalog: locale/*/LC_MESSAGES/django.po
Languages: cy

source: Please let us know what you were doing when you encountered this error.
cy: Rhowch wybod i ni beth roeddech yn wneud pan weloch chi'r gwall hwn.

source: Sorry, the page you requested was not found.
cy: Mae'n ddrwg gennym, nid yw'r dudalen rydych yn gofyn am wedi ei ganfod.

source: What did you think about the site?
cy: Beth oedd eich barn am y safle?

source: Please let us know if you have any comments, questions, or suggestions!
cy: Rhowch wybod i ni os oes gennych unrhyw sylwadau, gwestiynau, neu awgrymiadau!

source: Your email:
cy: Eich ebost:

source: Your Feedback
cy: Eich Adborth

source: Send Feedback
cy: Anfon Adborth

source: Thank you for your feedback.
cy: Diolch i chi am eich adborth.

source: If you would like to perform some additional testing
cy: Os hoffech chi i wneud rhai profion ychwanegol

source: please go to our
cy: ewch i'n

source: Litmus regression tests
cy: Profion atchweliad litmws

source: For new testers, we have
cy: Ar gyfer profwyr newydd, mae gennym

source: a getting started guide
cy: canllaw dechrau arni

source: Send more feedback.
cy: Anfonwch mwy o adborth.

source: Enter feedback please.
cy: Rhowch adborth os gwelwch yn dda.

source: View all
cy: Dangos popeth

source: Upload Subtitles
cy: Llwytho Isdeitlau

source: Our site accepts SRT, SSA, and TTML format. Only files ending in .srt, .ssa, or .xml (for TTML) are accepted.
cy: Mae ein safle yn derbyn fformat SRT, SSA, a TTML. Dim ond ffeiliau sy'n gorffen gyda .srt,. .ssa, neu xml (ar gyfer TTML) sy'n cael eu derbyn.

source: Login to upload subtitles
cy: Mewngofnodi i lwytho is-deitlau

source: If you believe your subtitle file is compatible, <a href='mailto:feedback@universalsubtitles.org'>send it to us</a>
cy: Os ydych yn credu fod eich ffeil isdeitlau yn gydweddol, <a href='mailto:feedback@universalsubtitles.org'>anfonwch hi atom</a>

source: Activity
cy: Gweithgaredd

source: Happened
cy: Ddigwyddodd

source: submited this video.
cy: a gyflwynwyd y fideo hwn.

source: changed title to "%(title)s"
cy: newidiodd y teitl i "%(title)s"

source: commented on %(language)s.
cy: wnaeth sylw ar ar %(language)s.

source: commented on this video.
cy: wnaeth sylw

source: edited
cy: golygwyd

source: original subtitles
cy: isdeitlau gwreiddiol

source: translation
cy: cyfieithiad

source: for
cy: ar gyfer

source: ago
cy: yn ôl

source: All activities
cy: Yr holl weithgareddau

source: User
cy: Defnyddiwr

source: Date
cy: Dyddiad

source: Video
cy: Fideo

source: There are no activities.
cy: Nid oes unrhyw weithgareddau.

source: Begin
cy: Dechrau

source: Subtitles will be rolled back to a previous version
cy: Bydd isdeitlau yn cael ei rholio nôl i'r fersiwn blaenorol

source: You need to log in to do that.
cy: Rhaid i chi fewngofnodi cyn gwneud hynny.

source: Comparing older revision (#%(second_version_no)s) to revision (#%(version_no)s)
cy: Yn cymharu diwygiad hŷn (#%(second_version_no)s) i ddiwygiad (#%(version_no)s)

source: Comparing older revision (#%(second_version_no)s) to current revision (#%(version_no)s)
cy: Yn cymharu diwygiad hŷn (#%(second_version_no)s) i'r diwygiad cyfredol (#%(version_no)s)

source: Subtitles
cy: Isdeitlau
