Repository: 8planes/mirosubs
Catalog: locale/*/LC_MESSAGES/django.po
Languages: cy

source: Argentinian Spanish
cy: Sbaeneg yr Ariannin

source: Username
cy: Enw defnyddiwr

source: Required. 30 characters or fewer. Alphanumeric characters only (letters, digits and underscores).
cy: Angenrheidiol: 30 llythyren neu lai. Nodau alffaniwmerig yn unig (llythrennau, rhifau neu tanlinell).

source: This value must contain only letters, numbers and underscores.
cy: Mae'n rhaid i'r maes gynnwys llythrennau, rhifau neu tanlinellau yn unig.

source: Password
cy: Cyfrinair

source: Password confirmation
cy: Cadarnhau'r cyfrinair

source: Email
cy: Ebost

source: Add comment
cy: Ychwanegu sylw

source: Start subtitles
cy: Dechrau'r isdeitlau

source: Start translation
cy: Dechrau'r cyfieithiad

source: Edit subtitles
cy: Golygu isdeitlau

source: Edit translation
cy: Golygu cyfieithiad

source: This user has not email
cy: Does gan y defnyddiwr hwn ddim ebost

source: You are not authenticated.
cy: Nid ydych wedi eich dilys

source: Personal message from %(sender)s on universalsubtitles.org
cy: Neges bersonol gan %(sender)s ar universalsubtitles.org

source: Confirm new password:
cy: Cadarnhau'r cyfrinair newydd

source: Invalid password.
cy: Cyfrinair annilys

source: The two passwords did not match.
cy: Nid oedd y ddau gyfrinair yr un fath

source: This email is used already.
cy: Mae'r ebost hwn wedi ei ddefnyddio yn barod

source: Somebody is subtitling this video right now. Try later.
cy: Mae rhywun yn isdeitlo'r fideo ar hyn o bryd. Triwch nes ymlaen.

source: You can't edit this video.
cy: Ni allwch chi olygu'r fideo hwn.

source: This video has translations.
cy: Mae gan y fideo hwn gyfieithiad.

source: File size should be less 1Mb
cy: Rhaid i'r ffeil fod yn llai na 1Mb

source: Incorrect format. Upload .srt, .ssa, or .xml (TTML format)
cy: Fformat anghywir. Llwythwch fyny .srt, .ssa neu .xml (fformat TTML)

source: Incorrect subtitles format
cy: Fformat isdeitlau anghywir.

source: Incorrect video url
cy: Cyfeiriad fideo anghywir

source: Enter valid e-mail addresses separated by commas.
cy: Rhowch gyfeiriadau e-bost dilys wedi ei gwahanu gyda chomas.

source: Share your subtitles
cy: Rhannwch eich isdeitlau

source: Now everyone can watch the video with subtitles-- try it!
cy: Nawr gall pawb wylio eich fideo gyda isdeitlau--rhowch gynnig arni!

source: Then tell the world and invite your friends to help translate:
cy: Yna dwedwch wrth y byd a gwahoddwch eich ffrindiau i helpu cyfieithu:

source: Post to Facebook
cy: Postio i Facebook

source: Post to Twitter
cy: Postio i Twitter

source: Email to friends
cy: Ebostio i ffrindiau

source: Embed Code
cy: Plannu Cod

source: Permalink
cy: Dolen barhaol

source: Embed this video in your site
cy: Plannwch y fideo hwn yn eich gwefan

source: We&#8217;d like help testing our subtitling widget
cy: Rydyn ni eisiau eich help i brofi'r teclyn isdeitlo

source: Just launch our feedback form and try captioning a video
cy: Lansiwch ein ffurflen adborth a ceisiwch rhoi capsiwn ar fideo

source: Test the Widget
cy: Profi'r teclyn

source: Warning: These videos should not be embeded--there is a good possibility they will break at some point!
cy: Rhybudd: Ni all y fideos fod yn blanedig--mi fydd posibilrwydd cryf y byddan nhw'n torri ar rhyw bwynt!

source: Warning #2: These subtitles are non-permanent and should not be relied on -- someone could change them.
cy: Rhybudd #2: Nid yw'r isdeitlau hyn yn rhai parhaol a ni ellir dibynnu arnyn nhw -- fe all rhywun eu newid nhw.

source: This alpha site is for purely testing purposes.
cy: Mae'r wefan alpha ar gyfer defnydd profi yn unig

source: Free and open tools for creating captions, subtitles, and translations for video.
cy: Teclynnau rhydd ac agored ar gyfer creu capsiynau, isdeitlau, a chyfieithiadau ar gyfer fideo.

source: Universal Subtitles does not support your browser. Upgrade your browser or <a href="http://getfirefox.com">Try Firefox</a>.
cy: Nid yw Universal Subtitles yn cefnogi eich porwr. Ewch i gael porwr mwy modern, neu

source: a project of the participatory culture foundation
cy: prosiect gan y sefydliad diwylliant cyfranogol

source: Subtitle a Video
cy: Isdeitlo Fideo

source: Videos
cy: Fideos

source: Volunteer
cy: Gwirfoddoli

source: About
cy: Amdan

source: Logout
cy: Allgofnodi

source: Admin
cy: Gweinyddu

source: Login
cy: Mewngofnodi

source: Universal Subtitles is a project of <a href="http://participatoryculture.org/">PCF</a>.
cy: Mae Universal Subtitles yn brosiect gan y <a href="http://participatoryculture.org/">PCF</a>.

source: Contact Us
cy: Cysylltwch â ni

source: Privacy Policy
cy: Polisi Preifatrwydd

source: Welcome to our alpha demo!
cy: Croeso i'n demo alffa!

source: <p style="clear: both"><strong>Got feedback?</strong> Use the form at the bottom of this page to give us your feedback, bugs, and opinions.</p> <p><strong>What's next?</strong> We’re working on an alpha version of our community website that will enable basic collaboration on subtitles and translations. Stay tuned!</p>
cy: <p style="clear: both"> <strong>Unrhyw adborth?</strong> Defnyddiwch y ffurflen ar waelod y y dudalen hon i roi eich adborth, gwallau neu farn i ni. </p> <p> <strong>Beth nesa?</strong> Rydym yn gweithio ar fersiwn alffa o'n gwefan gymunedol a fydd yn galluogi cydweithio syml ar isdeitlau a chyfieithiadau. Cadwch olwg! </p>

source: Frequently Asked Questions
cy: Cwestiynau Cyffredin

source: What is Universal Subtitles?
cy: Beth yw Universal Subtitles?

source: How can I use Universal Subtitles?
cy: Sut alla'i ddefnyddio Universal Subtitles?

source: What are the benefits of subtitles?
cy: Beth yw manteision isdeitlau?

source: Who is the Participatory Culture Foundation and why are they making Universal Subtitles?
cy: Pwy yw'r Sefydliad Diwylliant Cyfranogol a pham eu bod yn gwneud Isdeitlau Ymhobman?

source: Will Universal Subtitles support closed captions for the deaf and hard of hearing?
cy: A fydd Isdeitlau Ymhobman yn cefnogi capsiynau caeëdig ar gyfer pobl fyddar neu'n trwm eu clyw?

source: Will your subtitles support my language or characterset?
cy: A fydd eich isdeitlau yn cefnogi fy iaith neu set nodau?

source: When will the tools, including this site, be available in my language?
cy: Pryd fydd yr offer, yn cynnwys y wefan, ar gael yn fy iaith i?

source: How can I add subtitles to my video?
cy: Sut alla'i ychwanegu isdeitlau i fideo?

source: What open source license do you use?
cy: Pa drwydd cod agored ydych chi'n ddefnyddio?

source: I'm a developer, can I help out?
cy: Rwy'n ddatblygwr, sut alla'i helpu?

source: Can non-technical people get involved with the project?
cy: Gall pobl annhechnegol gyfrannu i'r prosiect?

source: Do you accept donations? Are they tax deductible?
cy: Ydych chi'n derbyn rhoddion? Ydi'n bosib didynnu treth ar y rhodd?

source: What is your relationship with Mozilla Drumbeat?
cy: Beth yw eich perthynas gyda Mozilla Drumbeat?

source: Where can I download subtitles in .SRT or other formats?
cy: Lle alla'i lwytho lawr isdeitlau .SRT neu fformatau eraill?

source: Why can't I change the timing on a translation?
cy: Pam alla'i ddim newid yr amser ar gyfieithiad?

source: Our goal with Universal Subtitles is to make it easy for anyone to add subtitles, captions, or translate nearly any video on the web. Furthermore, we're building in collaborative tools, and hope to attract a large body of contributors to assist in the subtitling effort. The software we're building is free and open source and can be used and improved upon by anyone.
cy: Ein nod gydag Isdeitlau Ymhobmab yw ei wneud yn hawdd i unrhyw un i ychwanegu isdeitlau, capsiynau, neu gyfieithu bron unrhyw fideo ar y we. Ymhellach, rydym yn adeiladu offer i gydweithio, ac yn gobeithio denu corff mawr o gyfranwyr i gynorthwyo gyda'r ymdrech isdeitlo. Mae'r meddalwedd rydym yn adeilad yn god agored ac am ddim a gellir ei ddefnyddio a'i wella gan unrhyw un.

source: You're welcome to try the subtitling technology in our <a href="/demo/">alpha demonstration</a>. This demo doesn't yet allow you to save subtitles, but that feature will be included in the alpha community launch (targeted for July 2010).
cy: Mae croeso i chi roi cynnig ar y dechnoleg isdeitlo yn ein <a href="/demo/">demo alffa</a>. Nid yw'r demo yn eich galluogi i gadw isdeitlau, ond bydd hynny'n cynnwys cael ei gynnwys yn y lansiad cymuned alffa (wedi'i dargedu ar gyfer Gorffennaf 2010).

source: Video subtitles are a gold mine of untapped potential.
cy: Mae isdeitlau fideo yn drysorfa o botensial heb ei gyffwrdd.

source: Captions make video more accessible for people with hearing disabilities
cy: Mae capsiynau gwneud fideo yn fwy hygyrch i bobl ag anableddau clyw

source: Translated subtitles make it possible for all of us to watch video in languages that we don't speak
cy: Mae isdeitlau wedi eu cyfieithu yn gwneud hi'n bosibl i bob un ohonom wylio fideo mewn ieithoedd nad ydym yn siarad

source: As an educator, storyteller, scientist, or anyone with a message, the potential size of your audience increases exponentially when you have subtitles and translations
cy: Fel addysgwr, storïwr, gwyddonydd, neu unrhyw un gyda neges, mae maint posibl eich cynulleidfa yn cynyddu yn esbonyddol pan mae gennych is-deitlau a chyfieithiadau

source: The Participatory Culture Foundation is a 501c3 non-profit organization whose mission, through software and advocacy, is to build a fairer, more open, and more democratic media space. PCF saw a gap in the marketplace for more open and collaborative subtitling -- Universal Subtitles is an attempt to fill that need.
cy: Mae'r Sefydliad Diwylliant Cyfranogol yn sefydliad di-elw 501c3 gyda'r bwriad, drwy feddalwedd ac eiriolaeth, o adeiladu gofod cyfryngol tecach, mwy agored a democrataidd. Roedd yr SDC yn gweld bwlch yn y farchnad am fwy o isdeitlo agored a chydweithredol - mae Isdeitlau Ymhobman yn ymgais i lenwi'r angen hwnnw.

source: Yes, we are working on a solution for making closed captions [including information about sounds and music], as well as subtitles/translations.
cy: Ydyn, rydyn yn gweithio ar ateb i wneud penawdau caeëdig [gan gynnwys gwybodaeth am sain a cherddoriaeth], yn ogystal ag isdeitlau/cyfieithiadau.

source: We will be working to support as many languages/charactersets as possible.
cy: Byddwn yn gweithio i gefnogi cyn gymaint o ieithoedd/set nodau ag y bo modd.

source: We're working towards having the subtitling widget and community website fully translatable, so the interfaces can be available in the user's native language.
cy: Rydym yn gweithio tuag at gael y teclyn isdeitlo a'r wefan gymunedol wedi eu cyfieithu yn llawn, felly y bydd y rhyngwynebau ar gael yn iaith y defnyddiwr.

source: Please add yourself to our announcement list (on the front page) and we'll let you know as soon as this is possible.
cy: Ychwanegwch eich hun at ein rhestr cyhoeddiadau (ar y dudalen flaen) a byddwn yn rhoi gwybod i chi cyn gynted ag y bo hyn yn bosibl.

source: For our subtitling widget and community website, we're using the <a href="http://en.wikipedia.org/wiki/Affero_General_Public_License">AGPL</a>.
cy: Ar gyfer ein teclyn isdeitlo a'r wefan gymunedol, rydym yn defnyddio'r <a href="http://en.wikipedia.org/wiki/Affero_General_Public_License">AGPL</a> .

source: Please do! If you're interested in coding and development, please visit our <a href="http://wiki.github.com/8planes/mirosubs/dev-center">developer center</a>.
cy: Os gwelwch yn dda! Os oes gennych ddiddordeb mewn codio a datblygu, ewch i'n <a href="http://wiki.github.com/8planes/mirosubs/dev-center">canolfan ddatblygwyr</a> .

source: If you're interested in general involvement, please see our <a href="https://www.drumbeat.org/project/universal-subtitles">Mozilla Drumbeat page</a>. If you have a specific idea, please get in touch: <a href="mailto:universalsubtitles@pculture.org">universalsubtitles@pculture.org</a> And as a 501c3 non-profit org, we do accept donations (see the next question for details).
cy: Os oes gennych ddiddordeb mewn cyfrannu yn gyffredinol, gweler ein <a href="https://www.drumbeat.org/project/universal-subtitles">tudalen Mozilla Drumbeat </a> . Os oes gennych chi syniad penodol, cysylltwch â ni: <a href="mailto:universalsubtitles@pculture.org">universalsubtitles@pculture.org</a> A fel sefydladi di-elw 501c3, rydym yn derbyn rhoddion (gweler y cwestiwn nesaf am fanylion).

source: Yes and yes! Right now, the Mozilla Foundation will match all contributions, up to a cumulative $25,000! You can <a href="http://blog.universalsubtitles.org/2010/04/30/mozilla-drumbeat-is-doubling-donations-to-universal-subtitles/">donate here</a>.
cy: Ie ac ie! Ar hyn o bryd, fe fydd Sefydliad Mozilla yn cyfateb pob cyfraniad, hyd at gyfanswm o $25,000! Gallwch chi <a href="http://blog.universalsubtitles.org/2010/04/30/mozilla-drumbeat-is-doubling-donations-to-universal-subtitles/">gyfrannu yma</a>.

source: The Mozilla Foundation has provided Universal Subtitles with seed funding, community support, and fundraising support through <a href="http://www.drumbeat.org/about">Drumbeat</a>. Drumbeat is a movement to keep the web open for the next 100 years, and Universal Subtitles is a featured project!
cy: Mae Sefydliad Mozilla wedi rhoi cyllid cychwynnol i Isdeitlau Ymhobmanm ynghyd â chymorth cymunedol a chymorth codi arian drwy <a href="http://www.drumbeat.org/about">Drumbeat</a>. Mae Drumbeat yn fudiad i gadw'r y we ar agor ar gyfer y 100 mlynedd nesaf, a mae Isdeitlau Ymhobman yn brosiect nodweddol!

source: Thanks for getting in touch! We love hearing your ideas, bugs, feedback, opinions and such.
cy: Diolch am gysylltu! Rydym wrth ein bodd yn clywed eich syniadau, gwallau, adborth, eich barn a pethau felly.

source: Stay tuned as the project evolves!
cy: Cadwch olwg wrth i'r prosiect ddatblygu!

source: Announcement Signup
cy: Tanysgrifio i'r Cyhoeddiadadau

source: Best
cy: Gorau

source: PS. We do our best to respond to all questions, but please be patient -- we get a lot of email
cy: PS. Rydym yn gwneud ein gorau i ymateb i bob cwestiwn, ond byddwch yn amyneddgar - rydym yn cael llawer o ebost

source: Subtitles and Captions for Every Video on the Web
cy: Isdeitlau a Capsiynau ar gyfer pob Fideo ar y We

source: The Problem
cy: Y Broblem

source: Web video is beginning to rival television, but there isn't a good open resource for subtitling.
cy: Mae fideo ar y we yn dechrau cystadlu gyda teledu, ond nid oes adnodd ar agor da ar gyfer isdeitlo.

source: Our Mission
cy: Ein Bwriad

source: We're trying to make captioning, subtitling, and translating video publicly accessible in a way that's free and open, just like the Web.
cy: Rydym yn ceisio gwneud capsiynu, isdeitlo, a chyfieithu fideo ar gael i'r cyhoedd mewn modd sydd am ddim ac yn agored, yn union fel y We.

source: Learn More
cy: Dysgwch Fwy

source: Right now
cy: Ar hyn o bryd

source: we're in an alpha stage, building and testing. You can help!
cy: rydym ni'n mewn cyfnod alffa, yn adeiladu a phrofi. Gallwch chi helpu!

source: Try our demo
cy: Rhowch gynnig ar ein demo

source: Become a tester
cy: Dewch yn brofwr

source: Subtitle Widget
cy: Teclyn Isdeitlo

source: A simple way to create and add captions to almost any video on the web (without having to transcode or re-upload videos).
cy: Ffordd syml i greu ac ychwanegu capsiynau i bron unrhyw fideo ar y we (heb orfod trawsgodio neu ail-lwytho fideos).

source: Community Site
cy: Gwefan y Gymuned

source: An online community for collaboratively subtitling and translating the world's videos (like a Wikipedia for subtitles).
cy: Cymuned ar lein ar gyfer cydweithio ar isdeitlo a chyfieithu fideos y byd (fel Wikipedia ar gyfer isdeitlau).

source: Subtitle Lookup Protocol
cy: Protocol Ymholiad Isdeitlau

source: An open standard to let Firefox extensions, desktop video players, websites, browsers--any client--find and retrieve subtitles for any video.
cy: Safon agored sy'n caniatáu estyniadau Firefox, chwaraewyr fideo pen desg, gwefannau, porwyr - unrhyw gleient - ddod o hyd i ac adalw isdeitlau ar gyfer unrhyw fideo.

source: Please enter a valid email address
cy: Rhowch gyfeiriad ebost dilys

source: Please enter your email address.
cy: Rhowch eich cyfeiriad ebost.

source: Mozilla will double your donation!
cy: Bydd Mozilla yn dyblu eich rhodd!

source: We're a featured Mozilla Drumbeat project!
cy: Rydym yn prosiect nodwedd Mozilla Drumbeat!

source: Donate Now
cy: Rhowch nawr

source: Check out the widget
cy: Rhowch cynnig ar y teclyn

source: Test our subtitling widget
cy: Profwch ein teclyn isdeitlo

source: Try the Demo
cy: Rhowch gynnig ar y Demo

source: <strong>Connect</strong> major stakeholders from projects, organizations, and movements that have open subtitling needs or focus.
cy: <strong>Cysylltu</strong> prif randdeiliaid drwy brosiectau, sefydliadau, a symudiadau sydd ag anghenion isdeitlo agored.

source: <strong>Identify ways</strong> to solve stakeholder subtitling needs and be aware of existing technology that can be leveraged. Find logical places for collaboration/cooperation.
cy: <strong>Nodi ffyrdd</strong> o ddatrys anghenion isdeitlo budd-ddeiliaid a bod yn ymwybodol o dechnoleg sy'n bodoli eisoes y gellir eu defnyddio. Dod o hyd i lefydd addas ar gyfer cydweithredu / cydweithrediad.

source: <strong>Move towards</strong> standardizing solutions and pushing forward the state of the art in open subtiting.
cy: <strong>Symud tuag at</strong> safoni atebion a gwthio'r dechnoleg ddiweddaraf ym maes isdeitlo agored.

source: Participants
cy: Cyfrannwyr

source: When
cy: Pryd

source: September 29th and 30th, beginning at 9am on both days.
cy: Medi 29 a'r 30ain, gan ddechrau am 9am ar y ddau ddiwrnod.

source: Where
cy: Lle

source: Last Updated: August 10, 2010
cy: Diweddarwyd: 10 Awst, 2010

source: Community Members
cy: Aelodau Cymunedol

source: Interactive Product Features
cy: Nodweddion Cynnyrch Rhyngweithiol

source: Security
cy: Diogelwch

source: Cookies and Clear GIFs
cy: Cwcis a GIFs Clir

source: What Are Cookies? A cookie is a string of information that a web site stores on a visitor's computer, and that the visitor's browser provides to the web site each time the visitor returns. Most major web sites use cookies. Because the browser provides this cookie information to the web site at each visit, cookies serve as a sort of label that allows a web site to "recognize" a browser when it returns to the site. The domain name in PCF cookies will clearly identify their affiliation with PCF and, where applicable, its third-party service provider.
cy: Beth yw Cwcis? Mae cwci yn llinyn o wybodaeth y mae gwefan yn storio ar gyfrifiadur yr ymwelydd, a mae'r porwr yn danfon y wybodaeth hynny bob tro mae'r ymwelydd yn dychwelyd. Mae'r rhan fwyaf o gwefannau mawr yn defnyddio cwcis. Oherwydd bod y porwr yn darparu y wybodaeth cwci hwn i'r wefan ar bob ymweliad, mae cwcis yn gwasanaethu fel rhyw fath o label sy'n caniatáu i wefan i \ "adnabod " porwr pan fydd yn dychwelyd i'r safle. Bydd yr enw parth yn y cwcis PCF yn nodi'n glir eu cysylltiad â PCF a, lle y bo'n gymwys, ei ddarparwr gwasanaeth trydydd parti.

source: What Are Clear GIFs?
cy: Beth yw GIFs Clir?

source: How We Use Cookies and Clear GIFs.
cy: Sut ydym yn defnyddio cwcis a GIFs clir.

source: Other Third Party Cookies.
cy: Cwcis Trydydd Parti Arall.

source: How to Control the Use of Cookies.
cy: Sut i Reoli y Defnydd o Cwcis.

source: Opt-out Procedures
cy: Trefniant Eithrio Allan

source: Privacy Policy Changes
cy: Newidiadau Polisi Preifatrwydd

source: Universal Subtitles
cy: Isdeitlau Ymhobman

source: View site
cy: Dangos gwefan

source: Sign in with your OpenID
cy: Mewngofnodwch gyda'ch IDAgored

source: Sign in
cy: Mewngofnodi

source: Edit Your Profile
cy: Golygu'ch Proffil

source: View profile
cy: Dangos proffil

source: Preferred Language
cy: Hoff Iaith

source: Homepage
cy: Hafan

source: Save Edits to Profile
cy: Cadw golygiadau i'r Proffil

source: Personal Info
cy: Gwybodaeth Bersonol

source: Upload picture
cy: Llwytho llun

source: Email me when something I've edited gets changed
cy: Ebostio fi pan fydd rhywbeth rwy' wedi golygu yn cael ei newid

source: Language Info
cy: Gwybodaeth Iaith

source: Languages I Know
cy: Ieithoedd Dwi'n Ddarllen

source: Remove Language
cy: Dileu Iaith

source: Add Language
cy: Ychwanegu Iaith

source: Email sent
cy: Anfonwyd ebost

source: Enter message please.
cy: Rhowch neges os gwelwch yn dda.

source: Enter email please.
cy: Rhowch e-bost os gwelwch yn dda.

source: Send a Message
cy: Anfon Neges

source: <i>User has not submitted a bio.</i>
cy: <i>Nid yw'r defnyddiwr wedi cyflwyno bywgraffiad.</i>

source: Send %(user_info)s a Message
cy: Anfon Neges i %(user_info)s

source: From
cy: Oddi Wrth

source: Message
cy: Neges

source: No HTML
cy: Dim HTML

source: Note: when you send a message the recipient can see your email and reply directly
cy: Noder: pan fyddwch yn anfon neges gall y derbynnydd weld eich ebost ac ymateb yn uniongyrchol

source: Home
cy: Hafan

source: Password reset
cy: Ailosod cyfrinair

source: Password reset complete
cy: Ailosod cyfrinair wedi cwblhau

source: Your password has been set. You may go ahead and log in now.
cy: Mae eich cyfrinair wedi ei ailosod. Fe allwch mynd yn eich blaen a mewngofnodi nawr.

source: Log in
cy: Mewngofnodi

source: Password reset confirmation
cy: Cadarnhad ailosod cyfrinair

source: Enter new password
cy: Rhowch gyfrinair newydd

source: Please enter your new password twice so we can verify you typed it in correctly.
cy: Rhowch eich cyfrinair newydd ddwywaith er mwyn i ni wirio eich bod wedi teipio yn gywir.

source: New password:
cy: Cyfrinair Newydd:

source: Confirm password:
cy: Cadarnhau cyfrinair:

source: Change my password
cy: Newid fy nghyfrinair

source: Password reset unsuccessful
cy: Ailosod cyfrinair yn aflwyddiannus

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
cy: Mae'r ddolen ailosod cyfrinair yn annilys, o bosibl oherwydd ei fod eisoes wedi cael ei ddefnyddio. Gwnech cais arall i ailosod eich cyfrinair.

source: Password reset successful
cy: Ailosodwyd y cyfrinair yn llwyddiannus

source: We've e-mailed you instructions for setting your password to the e-mail address you submitted. You should be receiving it shortly.
cy: Rydym wedi anfon cyfarwyddiadau ar sut i osod eich cyfrinair i'r cyfeiriad e-bost wnaethoch gyflwyno. Fe ddylech ei dderbyn cyn bo hir.

source: You're receiving this e-mail because you requested a password reset
cy: Rydych yn derbyn yr ebost hwn oherwydd eich bod wedi gwneud cais i ailosod eich cyfrinair

source: for your user account at %(site_name)s
cy: ar gyfer eich cyfrif defnyddiwr ar %(site_name)s

source: Please go to the following page and choose a new password:
cy: Ewch i'r dudalen ganlynol a dewis cyfrinair newydd:

source: Your username, in case you've forgotten:
cy: Eich enw defnyddiwr, rhag ofn eich bod wedi anghofio:

source: Thanks for using our site!
cy: Diolch am ddefnyddio ein safle!

source: The %(site_name)s team
cy: Tîm %(site_name)s

source: Forgotten your password? Enter your e-mail address below, and we'll e-mail instructions for setting a new one.
cy: Wedi anghofio eich cyfrinair? Rhowch eich cyfeiriad e-bost isod, a byddwn yn danfon cyfarwyddiadau mewn e-bost ar gyfer gosod un newydd.

source: E-mail address:
cy: Cyfeiriad ebost:

source: Reset my password
cy: Ailosod fy nghyfrinair

source: Anonymous
cy: Anhysbys

source: commented on
cy: wnaeth sylw ar

source: commented on this video
cy: wnaeth sylw ar y fideo hwn

source: edited %(lang)s translations for
cy: golygwyd cyfieithiad %(lang)s ar gyfer

source: edited subtitles for
cy: golygwyd isdeitlau ar gyfer
